In [110]:
import pandas as pd
import numpy as np

In [111]:
dataDictionary = {"İstanbul": [30,np.nan,29], "Ankara": [40,28,np.nan],"Antalya": [37,45,39]}

In [112]:
havadurumu = pd.DataFrame(dataDictionary,index = ["Pazartesi","Salı","Çarşamba"])

In [113]:
havadurumu

           İstanbul  Ankara  Antalya
Pazartesi      30.0    40.0       37
Salı            NaN    28.0       45
Çarşamba       29.0     NaN       39

In [114]:
havadurumu.dropna()

           İstanbul  Ankara  Antalya
Pazartesi      30.0    40.0       37

In [115]:
havadurumu.dropna(axis =0)

           İstanbul  Ankara  Antalya
Pazartesi      30.0    40.0       37

In [116]:
havadurumu.dropna(axis=1)

           Antalya
Pazartesi       37
Salı            45
Çarşamba        39

In [117]:
newdataDictionary = {"İstanbul": [30,np.nan,29], "Ankara": [40,28,np.nan],"Antalya": [37,45,39],"İzmir":[37,np.nan,np.nan]}
yenihavadurumu = pd.DataFrame(newdataDictionary,index = ["Pazartesi","Salı","Çarşamba"])

In [118]:
yenihavadurumu

           İstanbul  Ankara  Antalya  İzmir
Pazartesi      30.0    40.0       37   37.0
Salı            NaN    28.0       45    NaN
Çarşamba       29.0     NaN       39    NaN

In [119]:
yenihavadurumu.dropna(axis=1,thresh=2)

           İstanbul  Ankara  Antalya
Pazartesi      30.0    40.0       37
Salı            NaN    28.0       45
Çarşamba       29.0     NaN       39

In [120]:
yenihavadurumu.fillna(20,inplace = True)

In [121]:
yenihavadurumu

           İstanbul  Ankara  Antalya  İzmir
Pazartesi      30.0    40.0       37   37.0
Salı           20.0    28.0       45   20.0
Çarşamba       29.0    20.0       39   20.0

## Groupby

In [122]:
maassozlugu = {"Department":["Yazılım","Yazılım","Finans","Finans","Üretim","Üretim"],
              "Workers":["Ahmet","Ali","Mehmet","Menekşe","Melike","Melisa"],
              "Wages":[100,150,90,70,250,410]}

In [123]:
maasdataFrame  = pd.DataFrame(maassozlugu)

In [124]:
groupobjesi = maasdataFrame.groupby("Department")

In [125]:
groupobjesi.count()

            Workers  Wages
Department
Finans            2      2
Yazılım           2      2
Üretim            2      2

In [126]:
groupobjesi.mean()

            Wages
Department
Finans         80
Yazılım       125
Üretim        330

In [127]:
groupobjesi.max()

            Workers  Wages
Department
Finans      Menekşe     90
Yazılım         Ali    150
Üretim       Melisa    410

In [128]:
groupobjesi.min()

           Workers  Wages
Department
Finans      Mehmet     70
Yazılım      Ahmet    100
Üretim      Melike    250

In [129]:
groupobjesi.describe()

           Wages
           count   mean         std    min    25%    50%    75%    max
Department
Finans       2.0   80.0   14.142136   70.0   75.0   80.0   85.0   90.0
Yazılım      2.0  125.0   35.355339  100.0  112.5  125.0  137.5  150.0
Üretim       2.0  330.0  113.137085  250.0  290.0  330.0  370.0  410.0

## Concatenation

In [130]:
##pd.concat([dataFrame1,dataFrame2,dataFarme3])

## Merge

In [131]:
#pd.merge(mergedataFrame1,mergedataFrame2,mergedataFrame3)

## İleri Operasyonlar

In [136]:
maassozluk = {"İsim":["Ali","Mehmet","Batuhan","Menekşe","Melike"],
              "Departman":["Yazılım","Yazılım","Satış","Pazarlama","Finans"],
             "Maaş":[100,200,250,140,170]}

In [137]:
dataFrame = pd.DataFrame(maassozluk)

In [138]:
dataFrame

      İsim  Departman  Maaş
0      Ali    Yazılım   100
1   Mehmet    Yazılım   200
2  Batuhan      Satış   250
3  Menekşe  Pazarlama   140
4   Melike     Finans   170

In [141]:
dataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama', 'Finans'], dtype=object)

In [142]:
dataFrame["Departman"].nunique()

4

In [143]:
dataFrame["Departman"].value_counts()

Yazılım      2
Finans       1
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [148]:
def bruttennete(maas):
    return maas*0.6

In [149]:
dataFrame["Maaş"].apply(bruttennete)

0     60.0
1    120.0
2    150.0
3     84.0
4    102.0
Name: Maaş, dtype: float64

In [150]:
dataFrame.isnull()

    İsim  Departman   Maaş
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False
4  False      False  False

In [170]:
maassozluk = {"Şirket":["Havelsan","Havelsan","Aselsan","Aselsan","Tusaş","Tusaş"]
              ,"İsim":["Ali","Mehmet","Batuhan","Menekşe","Melike","Melike"],
              "Departman":["Yazılım","Yazılım","Satış","Pazarlama","Finans","Yazılım"],
             "Maaş":[100,200,250,140,170,40]}

In [171]:
pivotTable = pd.DataFrame(maassozluk)

In [172]:
pivotTable

     Şirket     İsim  Departman  Maaş
0  Havelsan      Ali    Yazılım   100
1  Havelsan   Mehmet    Yazılım   200
2   Aselsan  Batuhan      Satış   250
3   Aselsan  Menekşe  Pazarlama   140
4     Tusaş   Melike     Finans   170
5     Tusaş   Melike    Yazılım    40

In [174]:
pivotTable.pivot_table(values =["Maaş",],index= ["Şirket","Departman","İsim"])

                            Maaş
Şirket   Departman İsim
Aselsan  Pazarlama Menekşe   140
         Satış     Batuhan   250
Havelsan Yazılım   Ali       100
                   Mehmet    200
Tusaş    Finans    Melike    170
         Yazılım   Melike     40

In [179]:
maassozluk = {"Şirket":["Havelsan","Havelsan","Aselsan","Aselsan","Tusaş","Tusaş"]
              ,"İsim":["Ali","Mehmet","Batuhan","Menekşe","Melike","Melike"],
             "Maaş":[100,200,250,140,170,40]}

In [180]:
pivotTable = pd.DataFrame(maassozluk)

In [181]:
pivotTable

     Şirket     İsim  Maaş
0  Havelsan      Ali   100
1  Havelsan   Mehmet   200
2   Aselsan  Batuhan   250
3   Aselsan  Menekşe   140
4     Tusaş   Melike   170
5     Tusaş   Melike    40

In [183]:
pivotTable.pivot_table(values =["Maaş"],index= ["Şirket","İsim"])

                  Maaş
Şirket   İsim
Aselsan  Batuhan   250
         Menekşe   140
Havelsan Ali       100
         Mehmet    200
Tusaş    Melike    105

In [184]:
pivotTable.pivot_table(values =["Maaş"],index= ["Şirket","İsim"],aggfunc = np.sum)

                  Maaş
Şirket   İsim
Aselsan  Batuhan   250
         Menekşe   140
Havelsan Ali       100
         Mehmet    200
Tusaş    Melike    210